In [1]:
import pandas as pd
import numpy as np
import glob
import os

In [2]:
csv_path= "C:/Users/karsa_000/Desktop/TPANDAS/purchase_data.csv"

In [3]:
purchase_data = pd.read_csv(csv_path)

In [4]:
tot_play= purchase_data[str("SN")].value_counts().count()

In [5]:
Total_players= pd.DataFrame({"Total players":[tot_play]})
Total_players
#Player Count

   Total players
0            576

In [6]:
uniqueit= purchase_data[str("Item ID")].value_counts().count()

In [7]:
num_purchases= purchase_data[str("Item ID")].count()

In [8]:
revenue= purchase_data[("Price")].sum()

In [9]:
avg= purchase_data[("Price")].mean()

In [10]:
Total= pd.DataFrame({"Number of Unique Items": [uniqueit],
                           "Average Price": [avg],
                           "Number of Purchases": [num_purchases],
                           "Total Revenue": [revenue]})

In [11]:
Total["Average Price"] = Total["Average Price"].map(
    "${0:,.2f}".format)
Total
Total["Total Revenue"] = Total["Total Revenue"].map(
    "${0:,.2f}".format)
Total
#Purchasing Analysis_Total

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780     $2,379.77

In [12]:
pl= purchase_data["SN"].value_counts()

In [13]:
gen= purchase_data[str("Gender")].value_counts()

In [14]:
M = pd.DataFrame(purchase_data, columns=["SN","Gender","Age"])

In [15]:
pn = pd.DataFrame(M["SN"].unique())

In [16]:
pn.columns

RangeIndex(start=0, stop=1, step=1)

In [17]:
pn.columns = ['SN']

In [18]:
merge_test = pn.merge(M, left_index=True, right_index=True)
merge_test

               SN_x             SN_y                 Gender  Age
0           Lisim78          Lisim78                   Male   20
1       Lisovynya38      Lisovynya38                   Male   40
2        Ithergue48       Ithergue48                   Male   24
3     Chamassasya86    Chamassasya86                   Male   24
4         Iskosia90        Iskosia90                   Male   23
5           Yalae81          Yalae81                   Male   22
6         Itheria73        Itheria73                   Male   36
7       Iskjaskst81      Iskjaskst81                   Male   20
8         Undjask33        Undjask33                   Male   22
9       Chanosian48      Chanosian48  Other / Non-Disclosed   35
10        Inguron55        Inguron55                   Male   23
11     Haisrisuir60     Haisrisuir60                   Male   23
12     Saelaephos52     Saelaephos52                   Male   21
13      Assjaskan73      Assjaskan73                   Male   22
14      Saesrideu94      Saesrideu94                   Male   35
15        Lisassa64        Lisassa64                 Female   21
16        Lisirra25        Lisirra25                   Male   20
17        Zontibe81        Zontibe81                   Male   21
18        Reunasu60        Reunasu60                 Female   22
19        Chamalo71        Chamalo71                   Male   30
20     Iathenudil29     Iathenudil29                   Male   20
21    Phiarithdeu40    Phiarithdeu40                   Male   20
22     Siarithria38     Siarithria38  Other / Non-Disclosed   38
23         Eyrian71         Eyrian71                   Male   40
24          Siala43          Siala43                   Male   30
25        Lisirra87        Lisirra87                   Male   29
26       Lirtossa84       Lirtossa84                   Male   11
27          Eusri44          Eusri44                   Male    7
28           Aela59           Aela59                   Male   21
29          Tyida79          Tyida79                   Male   24
..              ...              ...                    ...  ...
546    Chanosiaya39       Sondadar26                   Male    9
547       Assylla81      Malarrian73                   Male   18
548       Aidaira26       Yathecal82                 Female   20
549        Eudanu84       Maluncil97  Other / Non-Disclosed   25
550      Chamiman85        Ilunyon70                   Male   20
551     Tyialisti80            Iri67                   Male   20
552       Marundi65         Hiaral50                   Male   15
553         Eusur90          Yadam35                   Male   28
554   Mindirranya33         Dyally87                   Male   22
555    Phiallylis33  Pheosurllorin41                 Female   23
556          Isty55    Frichocesta66                   Male   20
557     Frichilsa31       Frichaya88                   Male   42
558      Chanista95    Lassadarsda57                 Female   25
559      Aellyria80        Iasrira89                   Male   23
560   Rastynusuir31        Zontibe81                   Male   21
561        Iljask75     Chanastnya43                   Male   22
562     Lisjaskan36        Marynde90                   Male   30
563   Mindjasksya61           Isri34                   Male   38
564  Frichirranya75       Chamjask73                 Female   22
565         Ilast79      Assastnya25                   Male   20
566       Eratiel90       Ardonmol96                   Male   20
567         Assim27    Lassirrasda85                   Male   20
568         Irith83         Syally44                   Male   17
569       Ilosian36    Baelollodeu94                 Female   20
570    Iskossasda43       Chadossa56                   Male   20
571          Hala31       Poshilsa82                   Male   16
572      Jiskjask80    Yoishirrala98                 Female   17
573      Aethedru70       Sundista37                   Male   26
574      Yathecal72         Undare39                   Male   23
575         Sisur91       Sondadar26                   Male    9

[576 rows x 4 columns]

In [19]:
Gen= merge_test[("Gender")].value_counts()

In [20]:
purchase_data.drop_duplicates(subset=["SN"]).shape

(576, 7)

In [21]:
merge_test.dtypes

SN_x      object
SN_y      object
Gender    object
Age        int64
dtype: object

In [22]:
pct= (merge_test["Gender"]).value_counts(normalize=True)*100

In [23]:
j= pd.concat(([Gen,pct]), axis=1)

In [24]:
j.columns=["Total Count","Percentage of Players"]

In [25]:
j.round(2)
#Gender Demographics

                       Total Count  Percentage of Players
Male                           476                  82.64
Female                          88                  15.28
Other / Non-Disclosed           12                   2.08

In [26]:
PA= pd.DataFrame(purchase_data, columns=["Gender","Item ID", "Price"])

In [27]:
isi= PA.set_index('Gender')

In [28]:
plz= isi.loc[("Male", "Female", "Other / Non-Disclosed"), ("Item ID")]

In [29]:
numM= plz["Male"].count()

In [30]:
numF= plz["Female"].count()

In [31]:
numO= plz["Other / Non-Disclosed"].count()

In [32]:
precio= isi.loc[("Male", "Female", "Other / Non-Disclosed"), ("Price")]

In [33]:
MM= precio["Male"].mean()

In [34]:
MF= precio["Female"].mean()

In [35]:
MO= precio["Other / Non-Disclosed"].mean()

In [36]:
am= precio["Male"].sum()

In [37]:
af= precio["Female"].sum()

In [38]:
ao= precio["Other / Non-Disclosed"].sum()

In [39]:
precio.sum()

2379.77

In [40]:
male_count= 476

In [41]:
female_count= 88

In [42]:
other_count= 12

In [43]:
avgplayM= am/male_count

In [44]:
avgplayF= af/female_count

In [45]:
avgplayo= ao/other_count

In [46]:
purchaseA= pd.DataFrame({"Gender": ["Female", "Male", "Other / Non-Disclosed"],
    "Purchase Count": [numF, numM, numO], 
                         "Average Purchase Price": [MF, MM, MO],
                           "Total Purchase Value": [af, am, ao],
                           "Avg Total Purchase per Person": [avgplayF, avgplayM, avgplayo], 
                        })

In [47]:
noo= pd.DataFrame(purchaseA).set_index('Gender')
noo

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.112955
Male,652,3.017853,1967.64,4.133697
Other / Non-Disclosed,15,3.346000,50.19,4.182500

In [48]:
noo["Average Purchase Price"] = noo["Average Purchase Price"].map(
    "${0:,.2f}".format)
noo["Total Purchase Value"] = noo["Total Purchase Value"].map(
    "${0:,.2f}".format)
noo["Avg Total Purchase per Person"] = noo["Avg Total Purchase per Person"].map(
    "${0:,.2f}".format)
noo

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.11
Male,652,$3.02,"$1,967.64",$4.13
Other / Non-Disclosed,15,$3.35,$50.19,$4.18

In [49]:
#Purchasing Analysis_Gender

In [50]:
print(merge_test["Age"].max())
print(merge_test["Age"].min())

44
7

In [51]:
bins= [0, 9.98, 14.98, 19.98, 24.98, 29.98, 34.98, 39.98, 50]
age_labels= ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [52]:
merge_test["rank"]= pd.cut(merge_test["Age"], bins, labels=age_labels)

In [53]:
grupoEda = merge_test.groupby("rank").count()

In [54]:
grupoEda.columns

Index(['SN_x', 'SN_y', 'Gender', 'Age'], dtype='object')

In [83]:
grupoEda["Percentage of Players"] = (grupoEda["SN_x"]/tot_play)*100

In [84]:
casi = grupoEda.rename(columns = {"SN_x": "Total Count"})

In [57]:
del grupoEda.index.name

In [85]:
merito= grupoEda.drop(['SN_y', 'Gender', 'Age'], axis=1)

In [86]:
merito1= merito.rename(columns = {"SN_x": "Total Count"})

In [60]:
merito1.round(2)
#Age Demographics

       Total Count  Percentage of Players
<10             15                   2.60
10-14           23                   3.99
15-19           98                  17.01
20-24          274                  47.57
25-29           73                  12.67
30-34           56                   9.72
35-39           28                   4.86
40+              9                   1.56

In [87]:
purchase_data["rank"]= pd.cut(purchase_data["Age"], bins, labels=age_labels)

In [88]:
borron= purchase_data.drop(["Purchase ID", 'Gender', 'Age', "Item ID", "Item Name"], axis=1)

In [89]:
agrupaciones = borron.groupby("rank")

In [90]:
cuentame = agrupaciones["SN"].count()

In [91]:
TPV = purchase_data.groupby("rank").sum()

In [92]:
avgprice = purchase_data.groupby("rank").mean()

In [93]:
borronTPV= TPV.drop(["Purchase ID", 'Age', "Item ID"], axis=1)

In [94]:
borronAVG= avgprice.drop(["Purchase ID", 'Age', "Item ID"], axis=1)

In [95]:
borro1= borronAVG.rename(columns = {"Price":"Average Purchase Price"})

In [96]:
agrupa = purchase_data.groupby("rank").count()

In [97]:
borronCT= agrupa.drop(["SN", 'Age', "Gender", "Item ID", "Item Name", "Price"], axis=1)

In [98]:
PANA= pd.concat([borronCT, borro1, borronTPV], axis=1)

In [99]:
PANA["Avg Total Purchase per Person"] = (PANA["Price"]/merito1["Total Count"])

In [100]:
panana= PANA.rename(columns = {"Purchase ID":"Purchase Count", 
                       "Price":"Total Purchase Value"})

In [75]:
purchaseA= panana.style.format({"Average Purchase Price":"${:,.2f}",
                               "Total Purchase Value":"${:,.2f}",
                               "Avg Total Purchase per Person":"${:,.2f}"})
purchaseA
# Purchasing Analysis-Age

In [101]:
spenders= purchase_data.groupby("SN")

In [102]:
top1= spenders["Purchase ID"].count()

In [103]:
topavg= spenders["Price"].mean()

In [104]:
topt= spenders["Price"].sum()

In [105]:
TOP = pd.DataFrame({"Purchase Count": top1,
                             "Average Purchase Price": topavg,
                             "Total Purchase Value": topt})

In [106]:
cinque = TOP.sort_values(["Total Purchase Value"], ascending=False).head()

In [82]:
cinque.style.format({"Average Purchase Price":"${:,.2f}"})
#Top Spenders

In [125]:
popu= purchase_data[['Item ID', 'Item Name', 'Price']]

In [126]:
grupopopus= popu.groupby(['Item ID', 'Item Name'])

In [113]:
PC= grupopopus["Price"].count()

In [114]:
surprise= grupopopus["Price"].sum()

In [115]:
totPV= surprise/PC

In [127]:
popuI= pd.DataFrame({"Purchase Count": PC, 
                    "Item Price": totPV,
                    "Total Purchase Value": surprise})

In [124]:
mimimi= popuI.sort_values(["Purchase Count"], ascending=False).head()
mimimi
#Most Popular Items

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [128]:
guy= popuI.sort_values(["Total Purchase Value"], ascending=False).head()
guy
#Most Profitable Items

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80